{
  "data": {
    "html_attributions": [],
    "result": {
      "name": "GP Motors (Teddington) Ltd",
      "rating": 4.8,
      "reviews": [
        {
          "author_name": "mike francis",
          "author_url": "https://www.google.com/maps/contrib/107525585527473673383/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0RWWn1FfuCoaSnN-pL3zRCubdJJoexUIOKFQs5yNrzqRHgA=s128-c0x00000000-cc-rp-mo",
          "rating": 5,
          "relative_time_description": "a month ago",
          "text": "We had just arrived in the UK from the Philippines via LHR and were on our way to the Isle of Man when I noticed that the car was misfiring and lacking power. I brought it to the nearest repair shop, GP Motors, and although they were fully booked, they understood my situation and kindly squeezed me into their tight schedule. They quickly diagnosed the problem and fixed the car perfectly. I’m truly grateful for their professionalism and excellent service!",
          "time": 1752142741,
          "translated": false
        },
        {
          "author_name": "Zana Morris",
          "author_url": "https://www.google.com/maps/contrib/101169374836635000617/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLJ5o3SifXTHU-Utvc2UX4lFdNFvABXwCe9MnlEjxopvBSq4w=s128-c0x00000000-cc-rp-mo",
          "rating": 5,
          "relative_time_description": "a month ago",
          "text": "As good as it gets. They serviced a classic car where no other garage would /could source the parts — and did so incredibly speedily. Perfect communication at all times. And incredible care taken. Couldn’t recommend highly enough.",
          "time": 1751025299,
          "translated": false
        },
        {
          "author_name": "Anna",
          "author_url": "https://www.google.com/maps/contrib/116497458317238475915/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiZ0tPcTmryWXouXvApOX2SX-E4caJSKsk_AHPFBRy0Woro9A1=s128-c0x00000000-cc-rp-mo",
          "rating": 1,
          "relative_time_description": "a month ago",
          "text": "Extremely poor service – not trustworthy\n\nI’ve taken my car to this garage for a full service and MOT two years in a row, expecting a thorough check and honest communication. Unfortunately, my experience has been deeply disappointing.\n\nFirstly, I asked for a new screw to be inserted into my tyre — this was not done, and no explanation was given.\n\nSecondly, the main reason I brought the car in was because warning lights were showing on the dashboard and the car had previously broken down. Just one week after the full service and MOT, my car broke down again, and I had to call AA Breakdown for help. Clearly, the issue was not resolved or even properly diagnosed during the service.\n\nLater, I discovered that my battery was extremely old and needed urgent replacement. This should have been an obvious thing to flag during a full service — but I was never told. What exactly was checked, then? Apart from possibly changing the oil, it feels like nothing else was done.\n\nI paid for a full service and MOT, but I’m left wondering what I actually paid for. This was a waste of time and money, and I no longer trust this garage with my vehicle.",
          "time": 1752860694,
          "translated": false
        },
        {
          "author_name": "Ash Shah",
          "author_url": "https://www.google.com/maps/contrib/117530744605779234238/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocKhx90GYXKeMmvBeXbfWZhwHTpAGM3dBptX6LEgT6x24U2f1Q=s128-c0x00000000-cc-rp-mo",
          "rating": 1,
          "relative_time_description": "5 months ago",
          "text": "Please avoid this garage or else you will regret. They are very strategic and intelligent to get money out of you and deliver very low quality of work or sometimes the job is not done or not diagnosed correctly. Looks like there are 2 partners (new owners) When you enter the garage and tell them the problem with your car and ask them how much will this work on the car cost, the owner will look at his partner and ask him strategically - how many hours of work, the other partner will then go... it will take more than 2 hours, even if it's a 10 min job. Then the first partner will try to show he is doing you a favour, he will say - ok just for you it will be 1 and a half hour job price (which is a lie as it will take around 10-15 minutes to fix) the catch is they will tell you to leave the car there and you can never be there to see it was a 10 min job. End of the day my car was misdiagnosed and the job wasn't even done. They still smiled and took my money. Such a shame. I suggest that please visit Car Clinic in North Wembley as they did the same job for £60 which GP motors quoted for £300. Car Clinic owner is an honest guy and will never rip you off and even source the parts cheaper in my experience.  I tried GP motors 3 times as they are local to me but they failed everytime and overcharged. Such a shame that these new owners have their daily money target and that's all they are interested in. They don't care about correct diagnosis or giving right honest quote to the customer. BAD BAD EXPERIENCE. You will notice the above pattern of games they plan when you enter the garage and will laugh - try it out. AVOID AT ANY COST. They don't even have approved machines to help with latest technology cars. They just do silly manual stuff and leave you with problems. Compare the prices with other garages around. Thank me later.",
          "time": 1742502845,
          "translated": false
        },
        {
          "author_name": "Ben Mitchell",
          "author_url": "https://www.google.com/maps/contrib/117239499132759198294/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLBEf8iiP91bpt-5Ah6QWFXdCcd18z4-g1eYFXCb-npRAL1LQ=s128-c0x00000000-cc-rp-mo",
          "rating": 5,
          "relative_time_description": "2 months ago",
          "text": "An extremely professional and humble organisation. When I called to explain the situation, I was miles from home and had asked the hotel staff for a recommendation. I can see why they recommended. G was extremely friendly. If I lived local I would use in the future. Thank you for your help , in my time of need.",
          "time": 1748250490,
          "translated": false
        }
      ]
    },
    "status": "OK"
  },
  "lastFetched": "2025-08-18T09:54:04.706Z",
  "nextFetchDate": "2025-08-24T18:30:00.000Z"
}