{
  "data": {
    "html_attributions": [],
    "result": {
      "name": "GP Motors (Teddington) Ltd",
      "rating": 4.7,
      "reviews": [
        {
          "author_name": "Anna",
          "author_url": "https://www.google.com/maps/contrib/116497458317238475915/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjXiZ0tPcTmryWXouXvApOX2SX-E4caJSKsk_AHPFBRy0Woro9A1=s128-c0x00000000-cc-rp-mo",
          "rating": 1,
          "relative_time_description": "a month ago",
          "text": "Extremely poor service – not trustworthy\n\nI’ve taken my car to this garage for a full service and MOT two years in a row, expecting a thorough check and honest communication. Unfortunately, my experience has been deeply disappointing.\n\nFirstly, I asked for a new screw to be inserted into my tyre — this was not done, and no explanation was given.\n\nSecondly, the main reason I brought the car in was because warning lights were showing on the dashboard and the car had previously broken down. Just one week after the full service and MOT, my car broke down again, and I had to call AA Breakdown for help. Clearly, the issue was not resolved or even properly diagnosed during the service.\n\nLater, I discovered that my battery was extremely old and needed urgent replacement. This should have been an obvious thing to flag during a full service — but I was never told. What exactly was checked, then? Apart from possibly changing the oil, it feels like nothing else was done.\n\nI paid for a full service and MOT, but I’m left wondering what I actually paid for. This was a waste of time and money, and I no longer trust this garage with my vehicle.",
          "time": 1752860694,
          "translated": false
        },
        {
          "author_name": "Maria Khan",
          "author_url": "https://www.google.com/maps/contrib/114827770223987213405/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocLVVvht3hQiHATgebffXkbEVPTg85ub1tsTyu6Se2wMTzHvqg=s128-c0x00000000-cc-rp-mo",
          "rating": 1,
          "relative_time_description": "2 weeks ago",
          "text": "I would not use this garage again for the reasons some other one star reviewers have mentioned.\n\nThe prices quoted were more than audi dealership prices. I asked them to look at a passenger door issue, the came back with no issue, took it an audi dealership and they diagnosed it, no charge for the diagnostic. Yet these guys charged £72 for a diagnostic. Claiming it includes VAT. I have never paid £72 for a diagnostic to date. Never paid VAT on this either.\n\nThese kind of issues, be it a small amount of money, leave me unable to trust the garage for the future. whilst sometimes you think you may save a small amount by going to these small garages, I have found it is more of a headache than a gain.  Will not be visiting again!",
          "time": 1756125102,
          "translated": false
        },
        {
          "author_name": "Nicholas Falcao (Nicholas)",
          "author_url": "https://www.google.com/maps/contrib/104149415568417613389/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjUcsFnD8913QoBYCVS9wwZIBnBbo_w4m9UTMLDPhjWmcEJktWZS=s128-c0x00000000-cc-rp-mo",
          "rating": 5,
          "relative_time_description": "3 weeks ago",
          "text": "Took my car in with a clogged DPF and Gurpreet did an amazing job. He explained everything clearly, carried out a full clean, and had the car running like new again. What really stood out is that he goes the extra mile — not only great with DPF cleans but also excellent with any other repair or service you might need.\n\nHighly recommend Gurpreet for DPF cleaning and all other car work. Professional, friendly, and trustworthy – I won’t go anywhere else now.",
          "time": 1755970759,
          "translated": false
        },
        {
          "author_name": "mike francis",
          "author_url": "https://www.google.com/maps/contrib/107525585527473673383/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a/ACg8ocL0RWWn1FfuCoaSnN-pL3zRCubdJJoexUIOKFQs5yNrzqRHgA=s128-c0x00000000-cc-rp-mo",
          "rating": 5,
          "relative_time_description": "2 months ago",
          "text": "We had just arrived in the UK from the Philippines via LHR and were on our way to the Isle of Man when I noticed that the car was misfiring and lacking power. I brought it to the nearest repair shop, GP Motors, and although they were fully booked, they understood my situation and kindly squeezed me into their tight schedule. They quickly diagnosed the problem and fixed the car perfectly. I’m truly grateful for their professionalism and excellent service!",
          "time": 1752142741,
          "translated": false
        },
        {
          "author_name": "Mr Singh",
          "author_url": "https://www.google.com/maps/contrib/101463662102251444353/reviews",
          "language": "en",
          "original_language": "en",
          "profile_photo_url": "https://lh3.googleusercontent.com/a-/ALV-UjVVEpVrlITOOPEXYzIxp1n_yOW18uuOl9uNCzmYMr_JH7rutII=s128-c0x00000000-cc-rp-mo-ba6",
          "rating": 3,
          "relative_time_description": "a week ago",
          "text": "Advice to management: if a repair can’t realistically be done within the timeframe a customer first asks for, just be upfront about it.\n\nDon’t just agree with them so you get the work, then later drag the job out and keep shifting the timings.\n\nSaying you’ll call back by a certain time and then not doing so, or promising the car will be ready when it won’t be, just comes across as poor communication.\n\nIt makes your business look unprofessional and hard to trust, and raises questions about the quality of your work.",
          "time": 1757000615,
          "translated": false
        }
      ]
    },
    "status": "OK"
  },
  "lastFetched": "2025-09-15T07:25:21.288Z",
  "nextFetchDate": "2025-09-21T18:30:00.000Z"
}